# Functions

In [1]:
import pandas as pd
import seaborn as sb

In [ ]:
sb.get_dataset_names()

In [2]:
df = sb.load_dataset("tips")
titanic=sb.load_dataset("titanic")
products=pd.read_csv("data/products.csv")

In [3]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
pup = pd.read_csv('data/Pupils.csv')

In [6]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

# String Functions

In [7]:
#Get the first row
pup["Name"][0]

'adar'

In [9]:
pup["Name"].str[0].head()

0    a
1    a
2    a
3    d
4    d
Name: Name, dtype: object

In [ ]:
#slice() - Slice substrings from each element in the Series or Index.

In [10]:
pup["Name"].str.slice(0,3).head()

0    ada
1    aga
2    avi
3    dan
4    din
Name: Name, dtype: object

In [11]:
pup["Name"].str.slice(1,3).head(

0    da
1    ga
2    vi
3    an
4    in
Name: Name, dtype: object

In [12]:
pup["Name"].str.slice(0,6,2).head()

0    aa
1    aa
2    ai
3    dn
4    dn
Name: Name, dtype: object

In [15]:
pup[["Name"]]

       Name
0      adar
1      agam
2       avi
3      dani
4      dina
5     efrat
6      ehud
7       eli
8     ester
9   evyatar
10   itamar
11     liel
12   lilach
13      mia
14   michal
15    moshe
16     noya
17     ofer
18     ohad
19     omer
20     orit
21     orit
22     rina
23    shely
24    talya
25    tomer
26      udi
27    yafit
28     yoav
29     yosi

In [18]:
pup["Name"].str.slice(4,0,-1)

0      rad
1      mag
2       iv
3      ina
4      ani
5     tarf
6      duh
7       il
8     rets
9     tayv
10    amat
11     lei
12    cali
13      ai
14    ahci
15    ehso
16     ayo
17     ref
18     dah
19     rem
20     tir
21     tir
22     ani
23    yleh
24    ayla
25    remo
26      id
27    tifa
28     vao
29     iso
Name: Name, dtype: object

In [21]:
pup["Name"].to_frame().assign(First_char= pup["Name"].str.slice(0,2)).head()

   Name First_char
0  adar         ad
1  agam         ag
2   avi         av
3  dani         da
4  dina         di

In [22]:
pup["Name"].head().to_frame().assign(First_char= pup["Name"].str.slice(0,2))

   Name First_char
0  adar         ad
1  agam         ag
2   avi         av
3  dani         da
4  dina         di

In [24]:
len(pup["Name"])

30

In [27]:
pup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 11 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     30 non-null     object
 1   Age      30 non-null     int64
 2   Country  30 non-null     object
 3   Height   30 non-null     int64
 4   Weight   30 non-null     int64
 5   avg      30 non-null     int64
 6   income   30 non-null     int64
 7   rooms    30 non-null     int64
 8   family   30 non-null     int64
 9   type     30 non-null     int64
 10  gen      30 non-null     object
dtypes: int64(8), object(3)
memory usage: 2.7+ KB

In [25]:
pup["Name"].str.len().head()

0    4
1    4
2    3
3    4
4    4
Name: Name, dtype: int64

In [26]:
pup["Name"].to_frame().assign(len=pup["Name"].str.len()).head()

   Name  len
0  adar    4
1  agam    4
2   avi    3
3  dani    4
4  dina    4

In [28]:
s =pd.Series(['1.  Hello    ','2.  World!\n ','3.  python.\t' ])

In [29]:
s.head()

0    1.  Hello
1    2.  World!\n
2    3.  python.\t
dtype: object

In [ ]:
# strip() like trim in SQL

In [30]:
s.str.strip()

0      1.  Hello
1     2.  World!
2    3.  python.
dtype: object

In [31]:
s.str.lstrip('123. ')

0    Hello
1    World!\n
2    python.\t
dtype: object

In [32]:
s.str.rstrip('!.\n\t ')

0     1.  Hello
1     2.  World
2    3.  python
dtype: object

In [33]:
s.str.strip('123!.\n\t ')

0     Hello
1     World
2    python
dtype: object

In [35]:
"v1-"+s.str.strip(" 123!.\n\t")+"-v2"

0     v1-Hello-v2
1     v1-World-v2
2    v1-python-v2
dtype: object

In [36]:
pup["Name"].head(20)

0        adar
1        agam
2         avi
3        dani
4        dina
5       efrat
6        ehud
7         eli
8       ester
9     evyatar
10     itamar
11       liel
12     lilach
13        mia
14     michal
15      moshe
16       noya
17       ofer
18       ohad
19       omer
Name: Name, dtype: object

In [38]:
pup["Name"].str.strip('ae').head(20)

0        dar
1        gam
2         vi
3       dani
4        din
5       frat
6        hud
7         li
8       ster
9     vyatar
10    itamar
11      liel
12    lilach
13        mi
14    michal
15      mosh
16       noy
17      ofer
18      ohad
19      omer
Name: Name, dtype: object

In [ ]:
#replace

In [39]:
pup["Name"].str.replace('a','_').head()

0    _d_r
1    _g_m
2     _vi
3    d_ni
4    din_
Name: Name, dtype: object

In [ ]:
#upper() , lower() , title()

In [40]:
pup["Name"].str.upper().head()

0    ADAR
1    AGAM
2     AVI
3    DANI
4    DINA
Name: Name, dtype: object

In [41]:
pup["Name"].str.lower().head()

0    adar
1    agam
2     avi
3    dani
4    dina
Name: Name, dtype: object

In [42]:
pup["Name"].str.title().head()

0    Adar
1    Agam
2     Avi
3    Dani
4    Dina
Name: Name, dtype: object

In [43]:
pup["Name"].to_frame().assign(initcap=pup["Name"].str.title()).head()

   Name initcap
0  adar    Adar
1  agam    Agam
2   avi     Avi
3  dani    Dani
4  dina    Dina

In [ ]:
#UPPER(COLUMN)='VALUE'  --- SQL

In [47]:
mask = pup["Name"].str.upper()=='AGAM'

In [48]:
pup[mask]

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
1  agam    6      GR     172      71   92    9200      5       4     2   F

In [49]:
s =pd.Series(['Hello World', "Hi Python"])

In [50]:
s

0    Hello World
1      Hi Python
dtype: object

In [51]:
s.str.split()

0    [Hello, World]
1      [Hi, Python]
dtype: object

In [52]:
s.str.split(' ')

0    [Hello, World]
1      [Hi, Python]
dtype: object

In [53]:
s.str.split(' ').str[0]

0    Hello
1       Hi
dtype: object

In [54]:
s.str.split(' ').str[-1]

0     World
1    Python
dtype: object

In [55]:
s.to_frame().assign(a =s.str.split(' ').str[0],
                    b=s.str.split(' ').str[-1])

             0      a       b
0  Hello World  Hello   World
1    Hi Python     Hi  Python

In [56]:
s =pd.Series(['050-5878878', "03-654467"])

In [57]:
s

0    050-5878878
1      03-654467
dtype: object

In [58]:
s.str.split('-')

0    [050, 5878878]
1      [03, 654467]
dtype: object

In [59]:
s.to_frame().assign(a =s.str.split('-').str[0],
                    b=s.str.split('-').str[-1])

             0    a        b
0  050-5878878  050  5878878
1    03-654467   03   654467

In [60]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

In [61]:
products.head()

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1
0,1,Chai,18.00,1,22/11/2024,5/31/2023
1,2,Chang,19.00,1,23/11/2024,6/1/2023
2,3,Aniseed Syrup,10.00,2,24/11/2024,6/2/2023
3,4,Chef Anton's Cajun Seasoning,22.00,2,25/11/2024,6/3/2023
4,5,Chef Anton's Gumbo Mix,21.35,2,26/11/2024,6/4/2023

In [62]:
products["ProductName"].str.split()

0                                   [Chai]
1                                  [Chang]
2                         [Aniseed, Syrup]
3        [Chef, Anton's, Cajun, Seasoning]
4              [Chef, Anton's, Gumbo, Mix]
                      ...
72                           [Rad, Kaviar]
73                        [Longlife, Tofu]
74                 [Rhanbrau, Klosterbier]
75                          [Lakkalikaari]
76    [Original, Frankfurter, grane, Soae]
Name: ProductName, Length: 77, dtype: object

In [65]:
products["ProductName"].str.split(expand=True)

               0            1      2          3     4
0           Chai         None   None       None  None
1          Chang         None   None       None  None
2        Aniseed        Syrup   None       None  None
3           Chef      Anton's  Cajun  Seasoning  None
4           Chef      Anton's  Gumbo        Mix  None
..           ...          ...    ...        ...   ...
72           Rad       Kaviar   None       None  None
73      Longlife         Tofu   None       None  None
74      Rhanbrau  Klosterbier   None       None  None
75  Lakkalikaari         None   None       None  None
76      Original  Frankfurter  grane       Soae  None

[77 rows x 5 columns]

In [64]:
products["ProductName"].str.split(' ',expand=True)

               0            1      2          3     4
0           Chai         None   None       None  None
1          Chang         None   None       None  None
2        Aniseed        Syrup   None       None  None
3           Chef      Anton's  Cajun  Seasoning  None
4           Chef      Anton's  Gumbo        Mix  None
..           ...          ...    ...        ...   ...
72           Rad       Kaviar   None       None  None
73      Longlife         Tofu   None       None  None
74      Rhanbrau  Klosterbier   None       None  None
75  Lakkalikaari         None   None       None  None
76      Original  Frankfurter  grane       Soae  None

[77 rows x 5 columns]

In [71]:
products["ProductName"].str.split(expand=True)[0]

0             Chai
1            Chang
2          Aniseed
3             Chef
4             Chef
          ...
72             Rad
73        Longlife
74        Rhanbrau
75    Lakkalikaari
76        Original
Name: 0, Length: 77, dtype: object

In [7]:
products["ProductName"].str.split(expand=True)[1]

0            None
1            None
2           Syrup
3         Anton's
4         Anton's
         ...
72         Kaviar
73           Tofu
74    Klosterbier
75           None
76    Frankfurter
Name: 1, Length: 77, dtype: object

In [67]:
products["start name"]=products["ProductName"].str.split(expand=True)[0]

In [69]:
products.head()

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1,start name
0,1,Chai,18.00,1,22/11/2024,5/31/2023,Chai
1,2,Chang,19.00,1,23/11/2024,6/1/2023,Chang
2,3,Aniseed Syrup,10.00,2,24/11/2024,6/2/2023,Aniseed
3,4,Chef Anton's Cajun Seasoning,22.00,2,25/11/2024,6/3/2023,Chef
4,5,Chef Anton's Gumbo Mix,21.35,2,26/11/2024,6/4/2023,Chef

In [5]:
products["ProductName"].str.split(' ',expand=True)

               0            1      2          3     4
0           Chai         None   None       None  None
1          Chang         None   None       None  None
2        Aniseed        Syrup   None       None  None
3           Chef      Anton's  Cajun  Seasoning  None
4           Chef      Anton's  Gumbo        Mix  None
..           ...          ...    ...        ...   ...
72           Rad       Kaviar   None       None  None
73      Longlife         Tofu   None       None  None
74      Rhanbrau  Klosterbier   None       None  None
75  Lakkalikaari         None   None       None  None
76      Original  Frankfurter  grane       Soae  None

[77 rows x 5 columns]

In [72]:
products.insert(2,'name2',products["ProductName"].str.split(expand=True)[0])

In [73]:
products

,ProductID,ProductName,name2,UnitPrice,CategoryID,Date,Date1,start name
0,1,Chai,Chai,18.00,1,22/11/2024,5/31/2023,Chai
1,2,Chang,Chang,19.00,1,23/11/2024,6/1/2023,Chang
2,3,Aniseed Syrup,Aniseed,10.00,2,24/11/2024,6/2/2023,Aniseed
3,4,Chef Anton's Cajun Seasoning,Chef,22.00,2,25/11/2024,6/3/2023,Chef
4,5,Chef Anton's Gumbo Mix,Chef,21.35,2,26/11/2024,6/4/2023,Chef
...,...,...,...,...,...,...,...,...
72,73,Rad Kaviar,Rad,15.00,8,31/05/2029,8/11/2023,Rad
73,74,Longlife Tofu,Longlife,10.00,7,30/06/2029,8/12/2023,Longlife
74,75,Rhanbrau Klosterbier,Rhanbrau,7.75,1,31/07/2029,8/13/2023,Rhanbrau
75,76,Lakkalikaari,Lakkalikaari,18.00,1,31/08/2029,8/14/2023,Lakkalikaari
76,77,Original Frankfurter grane Soae,Original,13.00,2,30/09/2029,8/15/2023,Original

# Numeric Functions

In [ ]:
#round()

In [74]:
pup.head()

   Name  Age Country  Height  Weight  avg  income  rooms  family  type gen
0  adar    6      SP     113      30   70   16700      7       6     1   M
1  agam    6      GR     172      71   92    9200      5       4     2   F
2   avi    7     ISR     143      58   82   12000      3       7     1   M
3  dani    7      US     160      70   90   15000      4       4     2   M
4  dina    7     ISR     110      26   64   10000      6       8     1   F

In [75]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [78]:
import numpy as np
np.round(df["total_bill"],0)

0      17.0
1      10.0
2      21.0
3      24.0
4      25.0
       ...
239    29.0
240    27.0
241    23.0
242    18.0
243    19.0
Name: total_bill, Length: 244, dtype: float64

In [80]:
np.round(df["total_bill"])

0      17.0
1      10.0
2      21.0
3      24.0
4      25.0
       ...
239    29.0
240    27.0
241    23.0
242    18.0
243    19.0
Name: total_bill, Length: 244, dtype: float64

In [81]:
df["total_bill"].round(1).head()

0    17.0
1    10.3
2    21.0
3    23.7
4    24.6
Name: total_bill, dtype: float64

In [82]:
np.floor(df["total_bill"]).head()

0    16.0
1    10.0
2    21.0
3    23.0
4    24.0
Name: total_bill, dtype: float64

In [83]:
np.ceil(df["total_bill"]).head()

0    17.0
1    11.0
2    22.0
3    24.0
4    25.0
Name: total_bill, dtype: float64

In [ ]:
#mul = Multiply DataFrames., div = Divide DataFrames

In [84]:
np.ceil(df["total_bill"].mul(100)).div(100).head()

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

# Date Functions

In [9]:
import pandas as pd
products = pd.read_csv("data/Products.csv")

In [10]:
products.head(20)

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1
0,1,Chai,18.00,1,22/11/2024,5/31/2023
1,2,Chang,19.00,1,23/11/2024,6/1/2023
2,3,Aniseed Syrup,10.00,2,24/11/2024,6/2/2023
3,4,Chef Anton's Cajun Seasoning,22.00,2,25/11/2024,6/3/2023
4,5,Chef Anton's Gumbo Mix,21.35,2,26/11/2024,6/4/2023
5,6,Grandma's Boysenberry Spread,25.00,2,27/11/2024,6/5/2023
6,7,Uncle Bob's Organic Dried Pears,30.00,7,28/11/2024,6/6/2023
7,8,Northwoods Cranberry Sauce,40.00,2,29/11/2024,6/7/2023
8,9,Mishi Kobe Niku,97.00,6,30/11/2024,6/8/2023
9,10,Ikura,31.00,8,29/02/2024,6/9/2023
10,11,Queso Cabrales,21.00,4,31/03/2024,6/10/2023
11,12,Queso Manchego La Pastora,38.00,4,30/04/2024,6/11/2023
12,13,Konbu,6.00,8,31/05/2024,6/12/2023
13,14,Tofu,23.25,7,30/06/2024,6/13/2023
14,15,Genen Shouyu,15.50,2,31/07/2024,6/14/2023
15,16,Pavlova,17.45,3,31/08/2024,6/15/2023
16,17,Alice Mutton,39.00,6,30/09/2024,6/16/2023
17,18,Carnarvon Tigers,62.50,8,24/05/2023,6/17/2023
18,19,Teatime Chocolate Biscuits,9.20,3,25/05/2023,6/18/2023
19,20,Sir Rodney's Marmalade,81.00,3,26/05/2023,6/19/2023

In [11]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date         77 non-null     object
 5   Date1        77 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 3.7+ KB

In [13]:
products["Date"]=pd.to_datetime(products["Date"],format="%d/%m/%Y")

In [14]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    77 non-null     int64
 1   ProductName  77 non-null     object
 2   UnitPrice    77 non-null     float64
 3   CategoryID   77 non-null     int64
 4   Date         77 non-null     datetime64[ns]
 5   Date1        77 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 3.7+ KB

In [15]:
products.head(30).sort_values("Date")

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1
17,18,Carnarvon Tigers,62.50,8,2023-05-24,6/17/2023
18,19,Teatime Chocolate Biscuits,9.20,3,2023-05-25,6/18/2023
19,20,Sir Rodney's Marmalade,81.00,3,2023-05-26,6/19/2023
20,21,Sir Rodney's Scones,10.00,3,2023-05-27,6/20/2023
21,22,Gustaf's Knackebrad,21.00,5,2023-05-28,6/21/2023
22,23,Tunnbrad,9.00,5,2023-05-29,6/22/2023
23,24,Guarana Fantastica,4.50,1,2023-05-30,6/23/2023
24,25,NuNuCa Nua-Nougat-Creme,14.00,3,2023-05-31,6/24/2023
9,10,Ikura,31.00,8,2024-02-29,6/9/2023
10,11,Queso Cabrales,21.00,4,2024-03-31,6/10/2023
11,12,Queso Manchego La Pastora,38.00,4,2024-04-30,6/11/2023
12,13,Konbu,6.00,8,2024-05-31,6/12/2023
13,14,Tofu,23.25,7,2024-06-30,6/13/2023
14,15,Genen Shouyu,15.50,2,2024-07-31,6/14/2023
15,16,Pavlova,17.45,3,2024-08-31,6/15/2023
16,17,Alice Mutton,39.00,6,2024-09-30,6/16/2023
0,1,Chai,18.00,1,2024-11-22,5/31/2023
1,2,Chang,19.00,1,2024-11-23,6/1/2023
2,3,Aniseed Syrup,10.00,2,2024-11-24,6/2/2023
3,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,6/3/2023
4,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,6/4/2023
5,6,Grandma's Boysenberry Spread,25.00,2,2024-11-27,6/5/2023
6,7,Uncle Bob's Organic Dried Pears,30.00,7,2024-11-28,6/6/2023
7,8,Northwoods Cranberry Sauce,40.00,2,2024-11-29,6/7/2023
8,9,Mishi Kobe Niku,97.00,6,2024-11-30,6/8/2023
26,27,Schoggi Schokolade,43.90,3,2025-07-31,6/26/2023
27,28,Rassle Sauerkraut,45.60,7,2025-08-31,6/27/2023
28,29,Tharinger Rostbratwurst,123.79,6,2025-09-30,6/28/2023
29,30,Nord-Ost Matjeshering,25.89,8,2025-10-31,6/29/2023
25,26,Gumbar Gummibarchen,31.23,3,2026-02-28,6/25/2023

In [18]:
products["val_Date"]=pd.to_datetime(products["Date1"],format="%m/%d/%Y")

In [19]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1,val_Date
0,1,Chai,18.00,1,2024-11-22,5/31/2023,2023-05-31
1,2,Chang,19.00,1,2024-11-23,6/1/2023,2023-06-01
2,3,Aniseed Syrup,10.00,2,2024-11-24,6/2/2023,2023-06-02
3,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,6/3/2023,2023-06-03
4,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,6/4/2023,2023-06-04
...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,2029-05-31,8/11/2023,2023-08-11
73,74,Longlife Tofu,10.00,7,2029-06-30,8/12/2023,2023-08-12
74,75,Rhanbrau Klosterbier,7.75,1,2029-07-31,8/13/2023,2023-08-13
75,76,Lakkalikaari,18.00,1,2029-08-31,8/14/2023,2023-08-14
76,77,Original Frankfurter grane Soae,13.00,2,2029-09-30,8/15/2023,2023-08-15

In [20]:
import datetime as dt

In [21]:
pd.Timestamp.today()

Timestamp('2023-06-07 18:44:06.311377')

In [22]:
products["Date"].dt.year.head()

0    2024
1    2024
2    2024
3    2024
4    2024
Name: Date, dtype: int32

In [23]:
products["Date"].dt.month.head()

0    11
1    11
2    11
3    11
4    11
Name: Date, dtype: int32

In [24]:
products["Date"].dt.day.head()

0    22
1    23
2    24
3    25
4    26
Name: Date, dtype: int32

In [25]:
products.assign(year1 =products["Date"].dt.year).head()

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1,val_Date,year1
0,1,Chai,18.00,1,2024-11-22,5/31/2023,2023-05-31,2024
1,2,Chang,19.00,1,2024-11-23,6/1/2023,2023-06-01,2024
2,3,Aniseed Syrup,10.00,2,2024-11-24,6/2/2023,2023-06-02,2024
3,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,6/3/2023,2023-06-03,2024
4,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,6/4/2023,2023-06-04,2024

In [26]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date,Date1,val_Date
0,1,Chai,18.00,1,2024-11-22,5/31/2023,2023-05-31
1,2,Chang,19.00,1,2024-11-23,6/1/2023,2023-06-01
2,3,Aniseed Syrup,10.00,2,2024-11-24,6/2/2023,2023-06-02
3,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,6/3/2023,2023-06-03
4,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,6/4/2023,2023-06-04
...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,2029-05-31,8/11/2023,2023-08-11
73,74,Longlife Tofu,10.00,7,2029-06-30,8/12/2023,2023-08-12
74,75,Rhanbrau Klosterbier,7.75,1,2029-07-31,8/13/2023,2023-08-13
75,76,Lakkalikaari,18.00,1,2029-08-31,8/14/2023,2023-08-14
76,77,Original Frankfurter grane Soae,13.00,2,2029-09-30,8/15/2023,2023-08-15

In [28]:
products.insert(5,'year',products["Date"].dt.year)

In [29]:
products

,ProductID,ProductName,UnitPrice,CategoryID,Date,year,Date1,val_Date
0,1,Chai,18.00,1,2024-11-22,2024,5/31/2023,2023-05-31
1,2,Chang,19.00,1,2024-11-23,2024,6/1/2023,2023-06-01
2,3,Aniseed Syrup,10.00,2,2024-11-24,2024,6/2/2023,2023-06-02
3,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,2024,6/3/2023,2023-06-03
4,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,2024,6/4/2023,2023-06-04
...,...,...,...,...,...,...,...,...
72,73,Rad Kaviar,15.00,8,2029-05-31,2029,8/11/2023,2023-08-11
73,74,Longlife Tofu,10.00,7,2029-06-30,2029,8/12/2023,2023-08-12
74,75,Rhanbrau Klosterbier,7.75,1,2029-07-31,2029,8/13/2023,2023-08-13
75,76,Lakkalikaari,18.00,1,2029-08-31,2029,8/14/2023,2023-08-14
76,77,Original Frankfurter grane Soae,13.00,2,2029-09-30,2029,8/15/2023,2023-08-15

In [ ]:
products.insert(0,'month',products["Date"].dt.month)

In [34]:
products

,month,ProductID,ProductName,UnitPrice,CategoryID,Date,year,Date1,val_Date
0,11,1,Chai,18.00,1,2024-11-22,2024,5/31/2023,2023-05-31
1,11,2,Chang,19.00,1,2024-11-23,2024,6/1/2023,2023-06-01
2,11,3,Aniseed Syrup,10.00,2,2024-11-24,2024,6/2/2023,2023-06-02
3,11,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,2024,6/3/2023,2023-06-03
4,11,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,2024,6/4/2023,2023-06-04
...,...,...,...,...,...,...,...,...,...
72,5,73,Rad Kaviar,15.00,8,2029-05-31,2029,8/11/2023,2023-08-11
73,6,74,Longlife Tofu,10.00,7,2029-06-30,2029,8/12/2023,2023-08-12
74,7,75,Rhanbrau Klosterbier,7.75,1,2029-07-31,2029,8/13/2023,2023-08-13
75,8,76,Lakkalikaari,18.00,1,2029-08-31,2029,8/14/2023,2023-08-14
76,9,77,Original Frankfurter grane Soae,13.00,2,2029-09-30,2029,8/15/2023,2023-08-15

In [35]:
products["MM"]=products["Date"].dt.month.head()

In [36]:
products.head()

,month,ProductID,ProductName,UnitPrice,CategoryID,Date,year,Date1,val_Date,MM
0,11,1,Chai,18.00,1,2024-11-22,2024,5/31/2023,2023-05-31,11.0
1,11,2,Chang,19.00,1,2024-11-23,2024,6/1/2023,2023-06-01,11.0
2,11,3,Aniseed Syrup,10.00,2,2024-11-24,2024,6/2/2023,2023-06-02,11.0
3,11,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,2024,6/3/2023,2023-06-03,11.0
4,11,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,2024,6/4/2023,2023-06-04,11.0

In [37]:
products["Date"].dt.day.head()

0    22
1    23
2    24
3    25
4    26
Name: Date, dtype: int32

In [38]:
(products["Date"] + pd.DateOffset(days=1)).head()

0   2024-11-23
1   2024-11-24
2   2024-11-25
3   2024-11-26
4   2024-11-27
Name: Date, dtype: datetime64[ns]

In [39]:
(products["Date"] - pd.DateOffset(days=1,months=2,years=2)).head()

0   2022-09-21
1   2022-09-22
2   2022-09-23
3   2022-09-24
4   2022-09-25
Name: Date, dtype: datetime64[ns]

In [40]:
(products["Date"] - pd.Timestamp.today()).head()

0   533 days 05:05:20.893869
1   534 days 05:05:20.893869
2   535 days 05:05:20.893869
3   536 days 05:05:20.893869
4   537 days 05:05:20.893869
Name: Date, dtype: timedelta64[ns]

In [52]:
(products["Date"] - pd.Timestamp.today()).dt.days/365

0     1.460274
1     1.463014
2     1.465753
3     1.468493
4     1.471233
        ...
72    5.983562
73    6.065753
74    6.150685
75    6.235616
76    6.317808
Name: Date, Length: 77, dtype: float64

In [42]:
orders = pd.read_excel("data/orders.xlsx")

In [43]:
orders.head()

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,NaN,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,NaN,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,NaN,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,NaN,B-6000,Belgium

In [44]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   OrderID         830 non-null    int64
 1   CustomerID      830 non-null    object
 2   EmployeeID      830 non-null    int64
 3   OrderDate       830 non-null    datetime64[ns]
 4   RequiredDate    830 non-null    datetime64[ns]
 5   ShippedDate     809 non-null    datetime64[ns]
 6   ShipVia         830 non-null    int64
 7   Freight         830 non-null    float64
 8   ShipName        830 non-null    object
 9   ShipAddress     830 non-null    object
 10  ShipCity        830 non-null    object
 11  ShipRegion      323 non-null    object
 12  ShipPostalCode  811 non-null    object
 13  ShipCountry     830 non-null    object
dtypes: datetime64[ns](3), float64(1), int64(3), object(7)
memory usage: 90.9+ KB

In [45]:
timedelta_day=pd.Timestamp.today() -orders["OrderDate"]

In [47]:
timedelta_day

0     9834 days 18:57:46.801637
1     9833 days 18:57:46.801637
2     9830 days 18:57:46.801637
3     9830 days 18:57:46.801637
4     9829 days 18:57:46.801637
                 ...
825   9164 days 18:57:46.801637
826   9163 days 18:57:46.801637
827   9163 days 18:57:46.801637
828   9163 days 18:57:46.801637
829   9163 days 18:57:46.801637
Name: OrderDate, Length: 830, dtype: timedelta64[ns]

In [48]:
timedelta_day.dt.days/365

0      26.942466
1      26.939726
2      26.931507
3      26.931507
4      26.928767
         ...
825    25.106849
826    25.104110
827    25.104110
828    25.104110
829    25.104110
Name: OrderDate, Length: 830, dtype: float64

In [54]:
import numpy as np

In [ ]:
#timedelta— A duration of time used for manipulating dates

In [55]:
ld = pd.Timestamp.today()
td=np.timedelta64(1,'Y')
print(td)

1 years

In [56]:
ld = pd.Timestamp.today()
td=np.timedelta64(1,'M')
print(td)

1 months

In [57]:
ld = pd.Timestamp.today()
td=np.timedelta64(1,'D')
print(td)

1 days

In [58]:
(products["Date"]-ld)/td

0      533.205447
1      534.205447
2      535.205447
3      536.205447
4      537.205447
         ...
72    2184.205447
73    2214.205447
74    2245.205447
75    2276.205447
76    2306.205447
Name: Date, Length: 77, dtype: float64

In [59]:
timedelta_day/ td

0      9834.790125
1      9833.790125
2      9830.790125
3      9830.790125
4      9829.790125
          ...
825    9164.790125
826    9163.790125
827    9163.790125
828    9163.790125
829    9163.790125
Name: OrderDate, Length: 830, dtype: float64

# Convert Functions

In [3]:
num_s = '$1345.936'
type(num_s)

str

In [4]:
num = num_s.replace('$','')
print(num)
type(num)

1345.936

str

In [5]:
num1 =pd.to_numeric(num)

In [6]:
type(num1)

numpy.float64

In [7]:
num1

1345.936

In [12]:
type(num1)

numpy.float64

In [8]:
x='3'
type(x)

str

In [9]:
x=3
type(x)

int

In [10]:
x=0.3
type(x)

float

In [11]:
x='$3'
type(x)

str

In [94]:
num2=pd.to_numeric(num1, downcast="integer")

In [95]:
print(num2)

1345.936

In [96]:
type(num2)

numpy.float64

In [97]:
n1='1,450'

In [98]:
type(n1)

str

In [100]:
n1=pd.to_numeric(n1)

ValueError: Unable to parse string "1,450" at position 0

In [101]:
type(n1)

str

In [102]:
n1=pd.to_numeric(n1,downcast='integer')

ValueError: Unable to parse string "1,450" at position 0

In [103]:
n1=pd.to_numeric(n1,errors='ignore',downcast='integer')

In [104]:
type(n1)

str

In [105]:
n1

'1,450'

In [106]:
n2 =n1.replace(',','')

In [107]:
n2

'1450'

In [108]:
type(n2)

str

In [109]:
n2=pd.to_numeric(n2)

In [110]:
n2

1450

In [111]:
type(n2)

numpy.int64

In [112]:
x=3.2

In [113]:
np.ceil(x)

4.0

In [114]:
pd.to_numeric(x)

3.2

In [116]:
y=pd.to_numeric(np.ceil(x))

In [119]:
y=int(y)

In [120]:
type(y)

int

#Convert String to_datetime

In [ ]:
dt1 = '31-12-2018'

In [ ]:
type(dt1)

In [ ]:
dt2 =pd.to_datetime(dt1)

In [ ]:
type(dt2)

In [ ]:
dt2.year

In [ ]:
dt2.month

In [ ]:
dt2.day

In [ ]:
#Convert to string

In [ ]:
#astype(str)

In [122]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        77 non-null     int32
 1   ProductID    77 non-null     int64
 2   ProductName  77 non-null     object
 3   UnitPrice    77 non-null     float64
 4   CategoryID   77 non-null     int64
 5   Date         77 non-null     datetime64[ns]
 6   year         77 non-null     int32
 7   Date1        77 non-null     object
 8   val_Date     77 non-null     datetime64[ns]
 9   MM           5 non-null      float64
dtypes: datetime64[ns](2), float64(2), int32(2), int64(2), object(2)
memory usage: 5.5+ KB

In [123]:
products

,month,ProductID,ProductName,UnitPrice,CategoryID,Date,year,Date1,val_Date,MM
0,11,1,Chai,18.00,1,2024-11-22,2024,5/31/2023,2023-05-31,11.0
1,11,2,Chang,19.00,1,2024-11-23,2024,6/1/2023,2023-06-01,11.0
2,11,3,Aniseed Syrup,10.00,2,2024-11-24,2024,6/2/2023,2023-06-02,11.0
3,11,4,Chef Anton's Cajun Seasoning,22.00,2,2024-11-25,2024,6/3/2023,2023-06-03,11.0
4,11,5,Chef Anton's Gumbo Mix,21.35,2,2024-11-26,2024,6/4/2023,2023-06-04,11.0
...,...,...,...,...,...,...,...,...,...,...
72,5,73,Rad Kaviar,15.00,8,2029-05-31,2029,8/11/2023,2023-08-11,NaN
73,6,74,Longlife Tofu,10.00,7,2029-06-30,2029,8/12/2023,2023-08-12,NaN
74,7,75,Rhanbrau Klosterbier,7.75,1,2029-07-31,2029,8/13/2023,2023-08-13,NaN
75,8,76,Lakkalikaari,18.00,1,2029-08-31,2029,8/14/2023,2023-08-14,NaN
76,9,77,Original Frankfurter grane Soae,13.00,2,2029-09-30,2029,8/15/2023,2023-08-15,NaN

In [124]:
products["Date"] = products["Date"].astype('str')

In [125]:
products["Date"]

0     2024-11-22
1     2024-11-23
2     2024-11-24
3     2024-11-25
4     2024-11-26
         ...
72    2029-05-31
73    2029-06-30
74    2029-07-31
75    2029-08-31
76    2029-09-30
Name: Date, Length: 77, dtype: object

In [126]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month        77 non-null     int32
 1   ProductID    77 non-null     int64
 2   ProductName  77 non-null     object
 3   UnitPrice    77 non-null     float64
 4   CategoryID   77 non-null     int64
 5   Date         77 non-null     object
 6   year         77 non-null     int32
 7   Date1        77 non-null     object
 8   val_Date     77 non-null     datetime64[ns]
 9   MM           5 non-null      float64
dtypes: datetime64[ns](1), float64(2), int32(2), int64(2), object(3)
memory usage: 5.5+ KB

In [ ]:
products

In [ ]:
#Nulls

In [128]:
cust = pd.read_csv("Customers.csv")

In [129]:
cust.head(5)

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NaN,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NaN,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [130]:
cust[["CustomerID","CompanyName","Region"]].head()

   CustomerID                         CompanyName Region
0           1                 Alfreds Futterkiste    NaN
1           2  Ana Trujillo Emparedados y helados    NaN
2           3             Antonio Moreno Taquería    NaN
3           4                     Around the Horn    NaN
4           5                  Berglunds snabbköp    NaN

In [131]:
ifnull =cust["Region"].isnull()

In [132]:
cust[ifnull].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,NaN,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,NaN,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [134]:
ifnotnull =cust["Region"].notnull()

In [135]:
cust[ifnotnull].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
9,10,Bottom-Dollar Markets,Elizabeth Lincoln,Accounting Manager,23 Tsawassen Blvd.,Tsawassen,BC,T2F 8M4,Canada,(604) 555-4729,(604) 555-3745
14,15,Comércio Mineiro,Pedro Afonso,Sales Associate,"Av. dos Lusíadas, 23",Sao Paulo,SP,05432-043,Brazil,(11) 555-7647,NaN
20,21,Familia Arquibaldo,Aria Cruz,Marketing Assistant,"Rua Orós, 92",Sao Paulo,SP,05442-030,Brazil,(11) 555-9857,NaN
30,31,Gourmet Lanchonetes,André Fonseca,Sales Associate,"Av. Brasil, 442",Campinas,SP,04876-786,Brazil,(11) 555-9482,NaN
31,32,Great Lakes Food Market,Howard Snyder,Marketing Manager,2732 Baker Blvd.,Eugene,OR,97403,USA,(503) 555-7555,NaN

In [ ]:
#Filling null values with the previous ones -- fillna()

In [137]:
cust["Region"] = cust["Region"].fillna("No Region")

In [138]:
cust.head(5)

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
2,3,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,No Region,5023,Mexico,(5) 555-3932,NaN
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [ ]:
#Dropping missing values using dropna()

In [139]:
cust.count()

CustomerID      91
CompanyName     91
ContactName     91
ContactTitle    91
Address         91
City            91
Region          91
PostalCode      90
Country         91
Phone           91
Fax             69
dtype: int64

In [140]:
a= cust["PostalCode"].isnull()

In [141]:
cust[a].head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
36,37,Hungry Owl All-Night Grocers,Patricia McKenna,Sales Associate,8 Johnstown Road,Cork,Co. Cork,NaN,Ireland,2967 542,2967 3333

In [142]:
#drop all rows that have any NaN values
dn=cust.dropna()

In [143]:
dn.head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,1,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,No Region,12209,Germany,030-0074321,030-0076545
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,No Region,5021,Mexico,(5) 555-4729,(5) 555-3745
3,4,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,No Region,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,5,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,No Region,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
5,6,Blauer See Delikatessen,Hanna Moos,Sales Representative,Forsterstr. 57,Mannheim,No Region,68306,Germany,0621-08460,0621-08924

In [144]:
dn.info()

<class 'pandas.core.frame.DataFrame'>
Index: 68 entries, 0 to 90
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    68 non-null     int64
 1   CompanyName   68 non-null     object
 2   ContactName   68 non-null     object
 3   ContactTitle  68 non-null     object
 4   Address       68 non-null     object
 5   City          68 non-null     object
 6   Region        68 non-null     object
 7   PostalCode    68 non-null     object
 8   Country       68 non-null     object
 9   Phone         68 non-null     object
 10  Fax           68 non-null     object
dtypes: int64(1), object(10)
memory usage: 6.4+ KB

In [145]:
dn.count()

CustomerID      68
CompanyName     68
ContactName     68
ContactTitle    68
Address         68
City            68
Region          68
PostalCode      68
Country         68
Phone           68
Fax             68
dtype: int64

In [146]:
 #drop only if ALL columns are NaN
dn1=cust.dropna(how='all')

In [147]:
dn1.count()

CustomerID      91
CompanyName     91
ContactName     91
ContactTitle    91
Address         91
City            91
Region          91
PostalCode      90
Country         91
Phone           91
Fax             69
dtype: int64

In [148]:
#Drop only if NaN in specific column (as asked in the question)
dn2=cust.dropna(subset=["PostalCode"])

In [149]:
dn2.count()

CustomerID      90
CompanyName     90
ContactName     90
ContactTitle    90
Address         90
City            90
Region          90
PostalCode      90
Country         90
Phone           90
Fax             68
dtype: int64